app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:songs_list].path, headers: true) do |song|
      Customer.create(title: song[0], artist_id: Artist.find_or_create_by(name: song[1]).id)
---
INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-09-19 17:13:40.489875"], ["updated_at", "2018-09-19 17:13:40.489875"]]
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Caught Up in You"], ["artist_id", 137], ["created_at", "2018-09-19 17:13:40.492402"], ["updated_at", "2018-09-19 17:13:40.492402"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]